DataProcessors/СверкаСБанком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>СверкаСБанком</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Загруженные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольОтдела</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РольОтдела</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтзыва</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баланс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отозванные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтзыва</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Активные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольОтдела</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РольОтдела</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПривязкаОтдел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаОтдел</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПул</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПулПовторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РольОтдела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РольОтдела</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обзвон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выездной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информационный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрекращениеРаботы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПередачаДолжников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПередачаДолжников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Передачи</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтдел</xr:Item>
				<xr:Item>InformationRegister.ПривязкаСотрудник</xr:Item>
				<xr:Item>InformationRegister.Выезд</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтветственный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятиеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередачаВСвободныйПул</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольОтдела</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольОтдела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказПередачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/СверкаСБанком/Forms/Форма/Ext/Form/Module.bsl
// ЗагрузитьИзФайла после слияния
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтметкаСвои = 10; ОтметкаБанк = 1; ОтметкаСовпадающие = ОтметкаСвои + ОтметкаБанк;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуДолжников(Отозванные) Экспорт
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПривязкаОтделСрезПоследних.Должник КАК Должник,
	               |	ПРЕДСТАВЛЕНИЕ(ПривязкаОтделСрезПоследних.Должник) КАК ДолжникПредставление,
	               |	ПривязкаОтделСрезПоследних.Отдел КАК Отдел,
	               |	ПРЕДСТАВЛЕНИЕ(ПривязкаОтделСрезПоследних.Отдел) КАК ОтделПредставление,
	               |	ПривязкаОтделСрезПоследних.СвободныйПул КАК СвободныйПул,
	               |	ПривязкаОтделСрезПоследних.Регистратор КАК Регистратор,
	               |	ПривязкаОтделСрезПоследних.Период КАК ДатаОтзыва,
	               |	Договоры.Ссылка КАК Договор
	               |ИЗ
	               |	РегистрСведений.ПривязкаОтдел.СрезПоследних КАК ПривязкаОтделСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	               |		ПО ПривязкаОтделСрезПоследних.Должник = Договоры.Владелец
	               |ГДЕ
	               |	ПривязкаОтделСрезПоследних.Отдел.РольОтдела = &РольОтдела";
	Если Отозванные = Ложь Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПривязкаОтделСрезПоследних.Отдел.РольОтдела = &РольОтдела", "ПривязкаОтделСрезПоследних.Отдел.РольОтдела = &РольОтдела");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("РольОтдела", Перечисления.РольОтдела.Архив);

	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
КонецФункции

&НаКлиенте
Процедура ОбработатьКомандуФормы(Команда)
	Если Команда.Имя = "ЗагрузитьИзФайла" Тогда
		ЗагрузитьИзФайла();
	ИначеЕсли Команда.Имя = "ПоместитьВОтозванные" Тогда
		ПоместитьВОтозванные();
	ИначеЕсли Команда.Имя = "ПоместитьВАктивные" Тогда
		ПоместитьВАктивные();
	ИначеЕсли Команда.Имя = "ОтозванныеДобавитьИзБазы" Тогда
		ОтозванныеДобавитьИзБазы();
	ИначеЕсли Команда.Имя = "АктивныеДобавитьИзБазы" Тогда
		АктивныеДобавитьИзБазы();
	ИначеЕсли Команда.Имя = "ОтозванныеСвернуть" Тогда
		ОтозванныеСвернуть();
	ИначеЕсли Команда.Имя = "АктивныеСвернуть" Тогда
		АктивныеСвернуть();
	ИначеЕсли Команда.Имя = "АктивныеСвернуть" Тогда
		АктивныеСвернутьСДатойОтзыва();
	ИначеЕсли Команда.Имя = "АктивныеСформироватьПередачу" Тогда
		АктивныеСформироватьПередачу();
	ИначеЕсли Команда.Имя = "ОтозванныеСформироватьПередачу" Тогда
		ОтозванныеСформироватьПередачу();
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьИзФайла()
	ЗагрузкаДолжников = Обработки.ЗагрузкаДанных.Создать();
	ЗагрузкаДолжников.ПробоватьИсправитьНомерДоговора = ПробоватьИсправитьНомерДоговора;
	//
	//Форма = ЗагрузкаДолжников.ПолучитьФорму();
	//Форма.ВладелецФормы = ЭтаФорма;
	//Форма.ОткрытьМодально();
	//
	//Загруженные.Загрузить(ЗагрузкаДолжников.ТаблицаЗначенийЗагрузки.Скопировать());
КонецПроцедуры

&НаСервере
Процедура ПоместитьВОтозванные()
	ВременнаяТЗ = Объект.Загруженные.Выгрузить();
	ВременнаяТЗ.Колонки.Добавить("Отметка");
	ВременнаяТЗ.ЗаполнитьЗначения(ОтметкаБанк, "Отметка");
	
	Объект.Отозванные.Загрузить(ВременнаяТЗ.Скопировать());
КонецПроцедуры

&НаСервере
Процедура ПоместитьВАктивные()
	ВременнаяТЗ = Объект.Загруженные.Выгрузить();
	ВременнаяТЗ.Колонки.Добавить("Отметка");
	ВременнаяТЗ.ЗаполнитьЗначения(ОтметкаБанк, "Отметка");
	
	Объект.Активные.Загрузить(ВременнаяТЗ.Скопировать());
КонецПроцедуры

&НаСервере
Процедура ОтозванныеДобавитьИзБазы()
	ВременнаяТЗ = ПолучитьТаблицуДолжников(Истина);
	ВременнаяТЗ.Колонки.Добавить("Отметка");
	ВременнаяТЗ.ЗаполнитьЗначения(ОтметкаСвои, "Отметка");
	
	Объект.Отозванные.Загрузить(ВременнаяТЗ.Скопировать());
КонецПроцедуры

&НаСервере
Процедура АктивныеДобавитьИзБазы()
	ВременнаяТЗ = ПолучитьТаблицуДолжников(Ложь);
	
	ВременнаяТЗ.Колонки.Добавить("Отметка");
	ВременнаяТЗ.ЗаполнитьЗначения(ОтметкаСвои, "Отметка");
	
	Объект.Активные.Загрузить(ВременнаяТЗ.Скопировать());
КонецПроцедуры

&НаСервере
Процедура ОтозванныеСвернуть()
	ТЗ_Врем = Объект.Отозванные.Выгрузить();
	ТЗ_Врем.Свернуть("Договор, Должник", "Отметка");
	Объект.Отозванные.Загрузить(ТЗ_Врем);
КонецПроцедуры

&НаСервере
Процедура АктивныеСвернуть()
	ТЗ_Врем = Объект.Активные.Выгрузить();
	ТЗ_Врем.Свернуть("Договор, Должник", "Отметка");
	Объект.Активные.Загрузить(ТЗ_Врем);
КонецПроцедуры

&НаСервере
Процедура АктивныеСвернутьСДатойОтзыва()
	ТЗ_Врем = Объект.Отозванные.Выгрузить();
	ТЗ_Врем.Свернуть("Договор, Должник, ДатаОтзыва", "Отметка");
	Объект.Отозванные.Загрузить(ТЗ_Врем);
КонецПроцедуры

&НаКлиенте
Процедура ОтозванныеСформироватьПередачу()
	Форма = ПолучитьФорму("Документ.ПередачаДолжников.ФормаОбъекта");
	ДанныеФормы = Форма.Объект;
	ПередатьНаСервере(ДанныеФормы, "Отозванные"); // Заполняем документ на сервере
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); // копируем наш объект в объект формы и далее открываем ее
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура АктивныеСформироватьПередачу()
	Форма = ПолучитьФорму("Документ.ПередачаДолжников.ФормаОбъекта");
	ДанныеФормы = Форма.Объект;
	ПередатьНаСервере(ДанныеФормы, "Активные"); // Заполняем документ на сервере
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); // копируем наш объект в объект формы и далее открываем ее
	Форма.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПередатьНаСервере(ДанныеФормы, ИмяТаблицыДанных)
	ТаблицаДанных = Объект[ИмяТаблицыДанных];
	ДокументПередачи = Документы.ПередачаДолжников.СоздатьДокумент();
	ДокументПередачи.Автор = ПараметрыСеанса.Пользователь;
	ДокументПередачи.Дата = ТекущаяДатаСеанса();
	ДокументПередачи.Менеджер = ПараметрыСеанса.Пользователь;
	
	Для каждого ТекСтрока Из ТаблицаДанных Цикл
		Копировать = Ложь;
		Если ПоДаннымАгентства И ТекСтрока.Отметка = ОтметкаСвои Тогда
			Копировать = Истина;
		КонецЕсли;
		Если ПоДаннымБанка И ТекСтрока.Отметка = ОтметкаБанк Тогда
			Копировать = Истина;
		КонецЕсли;
		Если Совпадающие И ТекСтрока.Отметка = ОтметкаСовпадающие Тогда
			Копировать = Истина;
		КонецЕсли; 
		Если Копировать Тогда
			СтрокаДокумента = ДокументПередачи.Должники.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	ЗначениеВДанныеФормы(ДокументПередачи, ДанныеФормы);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтозванныеОписание");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Отозванные.Отметка");
	ЭлементОтбора.ПравоеЗначение = ОтметкаБанк;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "По данным банка отозван");
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтозванныеОписание");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Отозванные.Отметка");
	ЭлементОтбора.ПравоеЗначение = ОтметкаСвои;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "По данным агентства отозван");
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтозванныеОписание");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Отозванные.Отметка");
	ЭлементОтбора.ПравоеЗначение = ОтметкаСовпадающие;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "По данным агентства и банка совпадает");
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтозванныеОписание");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Отозванные.Отметка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементОтбора.ПравоеЗначение = ОтметкаБанк;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Отклонение. Необходимо рассмотреть подробнее.");
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры
